[{"title":"个人简历","date":"2019-09-12T08:02:39.000Z","path":"2019/09/12/个人简历/","text":"正在撰写中…….","tags":[]},{"title":"Markdown基本语法","date":"2019-09-11T14:36:36.000Z","path":"2019/09/11/Markdown基本语法/","text":"标题二级标题 三级标题四级标题五级标题六级标题 段落段落的换行是使用两个以上空格加上回车。新的段落 或者使用空出一行的方式（推荐）。 字体斜体1斜体2粗体1粗体2斜粗体1斜粗体2删除线下划线 分割线分割线有多种写法 脚注hexo需要安装插件才能使用脚注 因为页面布局问题，脚注的效果并不是很好 这是一个脚注11 生成一个脚注22 生成一个脚注33 列表无序列表无序列表有三种写法 第一项 第二项 第三项 第一项 第二项 第三项 表项1 表项2 表项3 有序列表 表项1 表项2 表项3 列表嵌套列表嵌套只需在子列表中的选项添加四个空格即可： 表项1 子表项 子表项 表项2 子表项 子表项 区块 区块效果 区块效果 区块效果 在列表中使用区块&amp;在区块中使用列表 表项 区块 1. 表项 2. 表项区块 * 表项 * 表项 区块 表项 表项 代码段落代码如果是段落上的一个函数或片段的代码可以用反引号把它包起来（`） print() 函数的使用 代码区块代码区块使用 4 个空格或者一个制表符（Tab 键）。 public void setEmpname(String empname){ this.empname=empname; } public void setBonus(Double bonus){ this.bonus=bonus; }可以用 ``` 包裹一段代码，并指定一种语言（这样可以语法高亮，也可以不指定）： 123456public void setEmpname(String empname)&#123; this.empname=empname;&#125;public void setBonus(Double bonus)&#123; this.bonus=bonus;&#125; 123$(document).ready(function () &#123; alert('RUNOOB');&#125;); 链接注意放在脚注下的内容是无效的，所以变量要写在脚注之前Runoob百度https://www.runoob.com 图片hexo不建议使用Markdown的![]()方式引用图片，而是使用了新的方法管理图片 如果要指定图片的高度与宽度，可以使用普通的 &lt;img&gt; 标签。 表格 表头 表头 表头 单元格 单元格 单元格 单元格 单元格 单元格 1.这里是 脚注 的 内容. ↩2.这里是脚注2的内容. ↩3.这里填写需要的脚注，一般放在页面最下面 ↩","tags":[{"name":"Markdown","slug":"Markdown","permalink":"http://drunkShrimper.github.io/blog/tags/Markdown/"}]},{"title":"总结过去与展望未来","date":"2019-09-11T14:03:36.000Z","path":"2019/09/11/总结过去与展望未来/","text":"向过去说再见大学生活注定是有苦有乐的。从大一的一腔热血、懵懵懂懂，到大二的得过且过与迷茫。再到大三重新设立目标，再次上路。过去的你是怎样的已经不重要了，重要的是你现在要做什么，你以后要做什么。大一时天真无邪，以为高三奋斗了好久啊，现在终于上到了大学，可以有一份还算是不错的工作。能够让家人不用日晒雨淋的日子了。 然而现实总是很残酷，以为上到大学，大家都是积极向上努力奋斗的。可是总会有些得过且过的人在影响这你。大学的课程，上课水一水，作业上网cv一下。期末考前背一背，还能考到个不错的成绩。甚至还沾沾自喜，以为自己找到了大学生活的诀窍。 然而，不管过去的你是如何的，只要能够设立目标，重新上路，努力提升自己，那就是最好的。 拥抱新生活在写这个博客时，我也是下了不少的决心的，因为自己的技术水平还远远不过关。还要花时间精力在写博客上，是不是太浪费时间了。然而，尽管自己还有很多需要努力的地方，还有继续奋斗。我还是想通过博客的方式记录一下自己的生活，不仅是技术上的，也是生活上的。 希望自己能过在接下来的日子里努力奋斗，一点一点的提升自己。因为大三还是有一些课程需要上（尽管我觉得听那些老师讲课并没有什么用，还不如自己跟着mooc学习），不能专心于自己的学习计划。所以我决定先给自己定几个短期的小目标，循序渐进。 同时也希望那些还在迷茫中的朋友能够尽快找到奋斗的目标，不断前进！ 短期计划 花大概一小时的时间学习Markdown语法，并使用博客记录学习笔记 将一些比较重要的有道云笔记的学习记录搬运过来 学习常用的办公软件 word Excel PPT","tags":[{"name":"情感","slug":"情感","permalink":"http://drunkShrimper.github.io/blog/tags/情感/"}]}]